# language: ru

@tag
Функционал: : Класс Generator для каждой пары Язык-Паттерн
  генерирует код

  Сценарий:
    Допустим  Я имею класс генератор
    Когда Я выбираю паттерн "Adapter"
    И Я выбираю язык "Java"
    И Я нажимаю кнопку Generate
    То Я получаю код, аналогичный коду в файле "00.txt"

  Сценарий:
    Допустим  Я имею класс генератор
    Когда Я выбираю паттерн "Adapter"
    И Я выбираю язык "C#"
    И Я нажимаю кнопку Generate
    То Я получаю код, аналогичный коду в файле "01.txt"

  Сценарий:
    Допустим  Я имею класс генератор
    Когда Я выбираю паттерн "Adapter"
    И Я выбираю язык "JavaScript"
    И Я нажимаю кнопку Generate
    То Я получаю код, аналогичный коду в файле "02.txt"

  Сценарий:
    Допустим  Я имею класс генератор
    Когда Я выбираю паттерн "Proxy"
    И Я выбираю язык "Java"
    И Я нажимаю кнопку Generate
    То Я получаю код, аналогичный коду в файле "10.txt"

  Сценарий:
    Допустим  Я имею класс генератор
    Когда Я выбираю паттерн "Proxy"
    И Я выбираю язык "C#"
    И Я нажимаю кнопку Generate
    То Я получаю код, аналогичный коду в файле "11.txt"

  Сценарий:
    Допустим  Я имею класс генератор
    Когда Я выбираю паттерн "Proxy"
    И Я выбираю язык "JavaScript"
    И Я нажимаю кнопку Generate
    То Я получаю код, аналогичный коду в файле "12.txt"

  Сценарий:
    Допустим  Я имею класс генератор
    Когда Я выбираю паттерн "Decorator"
    И Я выбираю язык "Java"
    И Я нажимаю кнопку Generate
    То Я получаю код, аналогичный коду в файле "20.txt"

  Сценарий:
    Допустим  Я имею класс генератор
    Когда Я выбираю паттерн "Decorator"
    И Я выбираю язык "C#"
    И Я нажимаю кнопку Generate
    То Я получаю код, аналогичный коду в файле "21.txt"

  Сценарий:
    Допустим  Я имею класс генератор
    Когда Я выбираю паттерн "Decorator"
    И Я выбираю язык "JavaScript"
    И Я нажимаю кнопку Generate
    То Я получаю код, аналогичный коду в файле "22.txt"

  Сценарий:
    Допустим  Я имею класс генератор
    Когда Я выбираю паттерн "Composite"
    И Я выбираю язык "Java"
    И Я нажимаю кнопку Generate
    То Я получаю код, аналогичный коду в файле "30.txt"

  Сценарий:
    Допустим  Я имею класс генератор
    Когда Я выбираю паттерн "Composite"
    И Я выбираю язык "C#"
    И Я нажимаю кнопку Generate
    То Я получаю код, аналогичный коду в файле "31.txt"

  Сценарий:
    Допустим  Я имею класс генератор
    Когда Я выбираю паттерн "Composite"
    И Я выбираю язык "JavaScript"
    И Я нажимаю кнопку Generate
    То Я получаю код, аналогичный коду в файле "32.txt"
